#include "../Comm Struct.h"
using namespace std;
//////// 0906 wanghaiying ///////////////////////////////////////////////////
//
//               数据和特征融合
/////////////////////////////////////////////////////////////

//假如主舰同时向N条邻舰请求信息，主舰收到N条邻舰的返回信息,需要将返回信息进行分类合并存放



///////////////////////////////////////////////////////////////////////////////////
///////////输入：本舰的请求信息，邻舰相应批号的返回信息(已经综合了不同邻舰返回的信息)
///////////输出：1--融合值，用此更新本舰协同目标的航迹信息，以及与之捆邦的相关ESM、COM各种信息
///////////      2--对于本舰的协同目标上缺少的相关信息，用融合的补（即协同取到互补作用）
///////////      3--融合结果一方面界面显示和更新、保存；另一方面：下发给态势分析模块 
////////////////////////////////////////////////////////////////////////////////////

void FusionCooperativeMsg(VCT_Request_Cooperative_Msg& vctReqMsg, VCT_BACK_Cooperative_Msg& vctBackMsg, /* 综合识别结果*/VCT_MIDENTIINFOR_MSG& vctMidentiinforMsg, VCT_Cooperative_FUSIDENTIINFOR& vctCoFusMsg);
